var data = {
        "सलूण गाँव (नागौर) से आये हुए": {
          परसाराम_: {},
          मोतीराम_: {},
          खींवाराम_: {},
          राजाराम_: {},
          हुणताराम_: {
            नोलाराम_: {
              डेडाराम_: {
                प्रेमाराम_: {
                  चुन्नीलाल_: {
                    रामस्वरूप: {
                      सतीश: {
                        दक्ष: {},
                      },
                      जितेन्द्र: {
                        जियांश: {},
                      },
                    },
                    इंद्राज: {
                      संदीप: {
                        जिश्नु: {},
                      },
                    },
                    विनोद: {
                      अमित: {},
                      मयंक: {},
                    },
                  },
                  पोकरमल: {
                    रामावतार: {
                      भरत: {},
                      देवांशु: {},
                    },
                    त्रिलोकचंद_: {},
                  },
                },
                मालाराम_: {
                  गोरुराम_: {
                    "द्वारका प्रसाद": {
                      दिनेश: {
                        आर्यन: {},
                      },
                      मुकेश: {
                        प्रिंस: {},
                        नवीन: {},
                      },
                      दीपचंद: {},
                      सुनिल: {
                        रुद्रांश: {},
                      },
                    },
                    चौथमल_: {
                      सुरेश: {},
                      रवि: {
                        चित्रांश: {},
                      },
                    },
                    मक्खनलाल: {
                      अरविंद: {
                        वासु: {},
                      },
                      योगेश: {},
                    },
                    बाबूलाल: {
                      लालचंद: {},
                      विकास: {},
                    },
                    त्रिलोकचंद: {
                      राहुल: {},
                    },
                    सांवरमल: {
                      आकाश: {},
                    },
                  },
                  ओंकारमल_: {
                    "सुभाष चन्द्र": {
                      आनंद: {},
                      विकास: {},
                    },
                    धर्मपाल: {
                      अनुकल्प: {},
                    },
                  },
                },
              },
              गीदाराम_: {
                लादूराम_: {
                  बालूराम_: {
                    कन्हेयाराम_: {
                      रतनलाल_: {
                        लालचंद: {},
                        बाबूलाल: {},
                      },
                    },
                    जीवनराम_: {},
                  },
                },
                शौल्याराम_: {
                  घीसाराम_: {
                    नौरंगलाल: {
                      किशोर: {
                        श्रीराम: {
                          आर्यन: {},
                          सुमित: {},
                        },
                        सतीश: {
                          गौरव: {},
                        },
                      },
                      दिनेश: {
                        गोविन्द: {},
                      },
                      केशरदेव: {
                        रितेश: {},
                      },
                      मुकेश: {
                        धीरज: {},
                      },
                      दीपक: {
                        सार्थक: {},
                      },
                    },
                    फूलाराम: {
                      विजय: {
                        प्रदीप: {},
                        शौर्य: {},
                      },
                      संदीप: {
                        हर्षित: {},
                      },
                    },
                  },
                },
              },
              "बहन (कोट शादी की हुई, गोठडीवाल गोत्र)_": {
                "गुटाराम (कोट से चारकाबास आ गया) _": {
                  नाथूराम_: {
                    रामेश्वर_: {
                      सोहनलाल_: {
                        अशोक: {
                          यश: {},
                        },
                        रविकांत: {},
                      },
                      "मक्खन लाल": {
                        दिनेश: {},
                      },
                      श्रीराम: {
                        अनिल: {
                          आरव: {},
                        },
                        राकेश: {
                          शिवांग: {},
                        },
                      },
                      कैलाश: {
                        दीपक: {},
                        विकाश: {},
                      },
                    },
                    कृष्णराम_: {
                      "बजरंग लाल": {
                        किशोर: {
                          पवित्र: {},
                        },
                        प्रमोद: {
                          जयेश: {},
                        },
                      },
                      मदनलाल: {
                        विवेक_: {
                          वीर: {},
                        },
                        प्रदीप: {
                          अंगद: {},
                        },
                        अमित: {},
                      },
                      केशरदेव: {
                        नितिन: {
                          गृतिक: {},
                        },
                        यतिन: {},
                      },
                      राधेश्याम: {
                        संदीप: {
                          "??": {},
                          "??": {},
                        },
                      },
                    },
                  },
                  दुलाराम_: {
                    मांगीलाल_: {
                      प्रकाश: {
                        सुनील: {},
                        मनोज: {},
                        रोहिताश: {},
                      },
                      सुभाष: {
                        नरेंद्र: {},
                        भारत: {},
                        अंकित: {},
                      },
                      राजेंद्र: {
                        पूरब: {},
                      },
                    },
                    रामकुंवर_: {
                      महेंद्र: {
                        संदीप: {},
                        श्रीकांत: {},
                      },
                    },
                  },
                },
              },
              हुक्माराम_: {
                नंदराम_: {
                  नाथूराम_: {
                    रामदेव_: {
                      प्रह्लादसिंह: {
                        सुरेश: {
                          कार्तिक: {},
                        },
                        रमेश: {
                          लक्ष्य: {},
                        },
                        बाबूलाल: {
                          विनीत: {},
                        },
                        श्रीराम: {},
                      },
                      मदनलाल: {
                        राजेश: {
                          योगेश: {},
                          ऋषभ: {},
                        },
                        महेंद्र: {
                          दीपक: {},
                          जयेश: {},
                        },
                        राकेश: {
                          राहुल: {},
                        },
                        इंद्राज: {
                          द्विज: {},
                          किअंश: {},
                        },
                      },
                      ओमप्रकाश: {},
                    },
                    हणमानाराम_: {
                      रामनिवास: {
                        भगीरथमल: {
                          कमल: {},
                        },
                        महेंद्र: {
                          नवीन: {},
                        },
                        रविकांत: {
                          निखिल: {},
                        },
                        प्रमोद: {},
                      },
                    },
                    रामप्रताप: {},
                    बंशीधर: {
                      सावरमल: {
                        राकेश: {},
                        दीपक: {},
                      },
                      शंकरलाल: {
                        मुकेश: {},
                        संजय: {},
                      },
                      विष्णु: {
                        राजकुमार: {},
                        राहुल: {},
                      },
                    },
                  },
                  महादेव_: {
                    मोहन_: {
                      "मनोहर लाल": {
                        महेश: {},
                        सुनील: {},
                      },
                      "राजेंद्र प्रसाद": {
                        सुमीत: {},
                        आदित्य: {},
                      },
                      सुरेश: {
                        दिनेश: {
                          राघव: {},
                        },
                        कृष्णगोपाल: {},
                        कार्तिक: {},
                      },
                    },
                    दानाराम_: {
                      रामवतार: {
                        विजय: {
                          कनिष्क: {},
                          लक्षित: {},
                        },
                        अजय: {},
                      },
                    },
                    "झुथाराम (गोद गया)": {},
                  },
                  श्योराम_: {
                    "झुथाराम (गोद लिया)_": {
                      प्रभातीलाल_: {},
                    },
                  },
                  "सीताराम (गोद गया)": {},
                },
                दयालाराम_: {
                  "सीताराम (गोद लिया)_": {
                    रिछपाल_: {
                      महेंद्र: {},
                      नरोत्तम: {
                        पंकज: {},
                        मोनू: {},
                      },
                    },
                    दुर्गाप्रसाद_: {
                      कुरड़ाराम: {},
                      जयप्रकाश: {},
                    },
                  },
                },
                हरजीराम_: {
                  गंगाराम_: {
                    गुलझारीलाल_: {
                      प्रमोद: {},
                      विकाश: {},
                      विक्रम: {},
                    },
                    गोपाल: {
                      जीतेन्द्र: {},
                      राहुल: {},
                    },
                    राजू: {},
                  },
                  गणपतराम_: {
                    पवन: {
                      कृष: {},
                      सचिन: {},
                    },
                  },
                },
                नारायणाराम_: {},
              },
            },
            पूराराम_: {
              नाथूराम_: {
                "जोधाराम (धमोरा)": {},
                "पनाराम  (धमोरा)": {},
                "हनुमान (गोद गया)": {},
              },
              खिवाराम_: {
                "हनुमान (गोद लिया)_": {
                  मंगलचंद: {
                    "सांवरमल (गोद गया दोनों के)_": {
                      नरेश: {},
                    },
                  },
                  परमेश्वर: {
                    "रघुवीर प्रसाद": {
                      मनोज: {
                        जयेश: {},
                      },
                      प्रमोद: {},
                    },
                    "विजय (बृजलाल)": {},
                  },
                  राधाकृष्णन: {
                    "सांवरमल (गोद गया दोनों के)_": {
                      नरेश: {},
                    },
                  },
                  महावीर: {
                    सुरेन्द्र: {},
                    नरेंद्र: {},
                  },
                },
              },
            },
            उदाराम_: {
              गलाराम_: {
                डालूराम: {
                  किशनाराम: {
                    गौरीशंकर: {
                      कैलाश: {},
                      मुखराम: {},
                      अनिल: {},
                    },
                    रूदराम: {
                      जीतू: {},
                      गोपाल: {},
                      सज्जन: {},
                    },
                    रिछपाल: {
                      ज्ञानचंद: {},
                      रोशन: {},
                    },
                    भागीरथ: {
                      विकाश: {},
                    },
                  },
                  जमनराम: {
                    "बजरंग लाल": {
                      "??": {},
                    },
                    संतोष: {
                      "??": {},
                    },
                  },
                  नरसाराम: {
                    बनवारीलाल: {
                      "??": {},
                    },
                    रविकांत: {
                      "??": {},
                      "??": {},
                    },
                  },
                  बालूराम: {
                    धुडाराम: {},
                    ओमप्रकाश: {
                      श्रीराम: {},
                      राकेश: {},
                    },
                    ताराचंद: {
                      दिनेश: {
                        गर्व: {},
                      },
                    },
                  },
                  सुखदेवराम_: {
                    खेमचंद_: {
                      राजेन्द्र: {
                        मोनू: {},
                      },
                      सुरेश: {
                        जतिन: {},
                        हर्षित: {},
                      },
                    },
                    हरिराम_: {
                      विनोद: {
                        दीपक: {},
                      },
                      मनोज: {},
                    },
                    केदारमल: {
                      बृजेश: {
                        करण: {},
                      },
                      बसंत: {
                        ग्रवित: {},
                      },
                    },
                    परमेश्वर_: {
                      संजय: {
                        हर्षित: {},
                        विराट: {},
                      },
                      अजय: {},
                    },
                    अमरचंद: {
                      विकास: {
                        शौर्य: {},
                      },
                    },
                    "ब्रम्हा दत": {
                      शुभम: {},
                    },
                  },
                },
                मुकनदराम_: {
                  सुरजराम_: {
                    जगदीश_: {
                      ओमप्रकाश: {
                        भंवरलाल: {
                          भाव्य: {},
                        },
                        दिलीप: {
                          वेद: {},
                          देव: {},
                        },
                      },
                      दयाराम: {
                        विक्की: {},
                        "कुलदीप": {}
                      },
                      अशोक: {
                        आर्यन : {}
                      },
                    },
                  },
                  टिकुराम_: {
                    केशरदेव_: {
                      सुरेश: {
                        दीपक: {},
                        अंकित: {},
                      },
                      बिहारीलाल: {},
                      महेंद्र: {
                        लकी: {},
                      },
                      उम्मेद: {},
                    },
                    बजरंग: {
                      बाबूलाल: {
                        राजा: {},
                        मोहित: {},
                      },
                      पिंटू: {},
                    },
                    प्रभु: {},
                    रामावतार: {
                      बिनोद: {},
                      नरेश: {},
                    },
                  },
                  रामदेवराम_: {
                    मदनलाल: {
                      कजोड़मल: {
                        नीरज: {},
                        पार्थ: {},
                      },
                      अनिल: {
                        विराज: {},
                      },
                    },
                    जयराम_: {
                      मनोज: {
                        वेदिस: {},
                      },
                      चोथमल: {
                        गौरव: {},
                      },
                      राजेश: {},
                    },
                  },
                },
              },
              चंद्राराम_: {},
            },
          },
        },
      };
      const root = document.getElementById("root");
      var renderName = (ele, obj) => {
        if (Object.keys(obj).length !== 0) {
          const ul = document.createElement("ul");
          Object.keys(obj).map((name) => {
            const li = document.createElement("li");
            const a = document.createElement("a");
            const img = document.createElement("img");
            img.src = "https://arvind-007.github.io/ckb/male_old.png";
            img.style.height = "70px";
            img.style.width = "100%";
            const span = document.createElement("span");
            span.style.display = "block";
            span.style.width = "100%";
            span.style.padding = "5px 10px";
            var name_ = name;
            if (name.split("").pop() == "_") {
              console.log("have _");
              a.classList.add("dead");
              name_ = name.slice(0, -1);
            }
            const node = document.createTextNode(name_);
            //a.appendChild(img);
            span.appendChild(node)
            a.appendChild(span);
            li.appendChild(a);
            renderName(li, obj[name]);
            ul.appendChild(li);
          });
          ele.appendChild(ul);
        }
      };
      renderName(root, data);

      $(function () {
        $("a").click(function () {
          if ($(this).children("i").length > 0) {
            $(this)
              .children("i")
              .toggleClass("fa-caret-up")
              .toggleClass("fa-caret-down");
          }
          $(this).next("ul").toggle();
        });

        $("li").each(function () {
          if ($(this).children("ul").length > 0) {
            $(this)
              .children("a")
              .append('<i class="fa fa-caret-down" class="arrow"></i>');
          }
        });

        $("ul").hide();
        $("ul").first().show();
        $("ul").eq(1).show();
        //$("body").scrollTo("0");
      });
